# üêº Ïã§Ï†Ñ Îç∞Ïù¥ÌÑ∞ÏÖã Í∏∞Î∞ò Pandas Î¨∏Ï†úÏßë

Îç∞Ïù¥ÌÑ∞ÏÖã: Titanic (https://www.kaggle.com/c/titanic)

Í∞Å Î¨∏Ï†úÎäî ÎÇúÏù¥ÎèÑÎ≥ÑÎ°ú Ï†ïÎ¶¨ÎêòÏñ¥ ÏûàÏäµÎãàÎã§.

## üîπ Ï¥àÍ∏â Î¨∏Ï†ú

### Î¨∏Ï†ú 1
CSV ÌååÏùºÏùÑ Î∂àÎü¨Ïò§Í≥† DataFrameÏùò ÏÉÅÏúÑ 5Í∞ú ÌñâÏùÑ Ï∂úÎ†•ÌïòÏÑ∏Ïöî.

In [50]:
import pandas as pd

# ÏòàÏãú: titanic.csv ÌååÏùº Î∂àÎü¨Ïò§Í∏∞
# df = pd.read_csv('titanic.csv')
# Ïó¨Í∏∞Ïóê ÏΩîÎìúÎ•º ÏûëÏÑ±ÌïòÏÑ∏Ïöî

df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Î¨∏Ï†ú 2
DataFrameÏùò Ïª¨ÎüºÎ™ÖÏùÑ Ï∂úÎ†•ÌïòÏÑ∏Ïöî.

In [51]:
import pandas as pd

# ÏòàÏãú: titanic.csv ÌååÏùº Î∂àÎü¨Ïò§Í∏∞
# df = pd.read_csv('titanic.csv')
# Ïó¨Í∏∞Ïóê ÏΩîÎìúÎ•º ÏûëÏÑ±ÌïòÏÑ∏Ïöî

df.keys()

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

### Î¨∏Ï†ú 3
Í≤∞Ï∏°Ïπò(null)Ïùò Í∞úÏàòÎ•º Ïª¨ÎüºÎ≥ÑÎ°ú ÌôïÏù∏ÌïòÏÑ∏Ïöî.

In [52]:
import pandas as pd

# ÏòàÏãú: titanic.csv ÌååÏùº Î∂àÎü¨Ïò§Í∏∞
# df = pd.read_csv('titanic.csv')
# Ïó¨Í∏∞Ïóê ÏΩîÎìúÎ•º ÏûëÏÑ±ÌïòÏÑ∏Ïöî

df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             30
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          125
Embarked         1
dtype: int64

### Î¨∏Ï†ú 4
ÌäπÏ†ï Ïª¨Îüº('Age')Ïùò ÌèâÍ∑†ÏùÑ Íµ¨ÌïòÏÑ∏Ïöî.

In [53]:
import pandas as pd
import numpy as np

# ÏòàÏãú: titanic.csv ÌååÏùº Î∂àÎü¨Ïò§Í∏∞
# df = pd.read_csv('titanic.csv')
# Ïó¨Í∏∞Ïóê ÏΩîÎìúÎ•º ÏûëÏÑ±ÌïòÏÑ∏Ïöî

df['Age'].mean()

np.float64(28.141507936507935)

### Î¨∏Ï†ú 5
Îç∞Ïù¥ÌÑ∞Î•º 'Age' Í∏∞Ï§ÄÏúºÎ°ú Ïò§Î¶ÑÏ∞®Ïàú Ï†ïÎ†¨ÌïòÏÑ∏Ïöî.

In [54]:
import pandas as pd

# ÏòàÏãú: titanic.csv ÌååÏùº Î∂àÎü¨Ïò§Í∏∞
# df = pd.read_csv('titanic.csv')
# Ïó¨Í∏∞Ïóê ÏΩîÎìúÎ•º ÏûëÏÑ±ÌïòÏÑ∏Ïöî

df_sorted = df.sort_values(by='Age', ascending=True)
df_sorted.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.00,3,1,349909,21.0750,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.00,4,1,382652,29.1250,NaN,Q
119,120,0,3,"Andersson, Miss. Ellis Anna Maria",female,2.00,4,2,347082,31.2750,NaN,S
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,NaN,C

## üîπ Ï§ëÍ∏â Î¨∏Ï†ú

### Î¨∏Ï†ú 1
'Sex' Ïª¨ÎüºÏóê Îî∞Î•∏ 'Age'Ïùò ÌèâÍ∑†ÏùÑ Íµ¨ÌïòÏÑ∏Ïöî.

In [55]:
import pandas as pd

# ÏòàÏãú: titanic.csv ÌååÏùº Î∂àÎü¨Ïò§Í∏∞
# df = pd.read_csv('titanic.csv')
# Ïó¨Í∏∞Ïóê ÏΩîÎìúÎ•º ÏûëÏÑ±ÌïòÏÑ∏Ïöî

avg_age_by_sex = df.groupby(['Sex'])['Age'].mean()
print(avg_age_by_sex)

Sex
female    24.468085
male      30.326962
Name: Age, dtype: float64

### Î¨∏Ï†ú 2
'Survived'Í∞Ä 1Ïù∏ Îç∞Ïù¥ÌÑ∞Îßå ÌïÑÌÑ∞ÎßÅÌïòÏÑ∏Ïöî.

In [58]:
import pandas as pd

# ÏòàÏãú: titanic.csv ÌååÏùº Î∂àÎü¨Ïò§Í∏∞
# df = pd.read_csv('titanic.csv')
# Ïó¨Í∏∞Ïóê ÏΩîÎìúÎ•º ÏûëÏÑ±ÌïòÏÑ∏Ïöî

df_survived = df[df['Survived'] == 1]
df_survived.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

### Î¨∏Ï†ú 3
Ï§ëÎ≥µÎêú ÌñâÏùÑ Ï†úÍ±∞ÌïòÏÑ∏Ïöî.

In [59]:
import pandas as pd

# ÏòàÏãú: titanic.csv ÌååÏùº Î∂àÎü¨Ïò§Í∏∞
# df = pd.read_csv('titanic.csv')
# Ïó¨Í∏∞Ïóê ÏΩîÎìúÎ•º ÏûëÏÑ±ÌïòÏÑ∏Ïöî

df_duplicated = df.drop_duplicates()
df_duplicated.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Î¨∏Ï†ú 4
Í∞Å Ïª¨ÎüºÏùò Îç∞Ïù¥ÌÑ∞ ÌÉÄÏûÖÏùÑ ÌôïÏù∏ÌïòÍ≥†, 'Age'Î•º Ï†ïÏàòÌòïÏúºÎ°ú Î≥ÄÌôòÌïòÏÑ∏Ïöî.

In [67]:
import pandas as pd

# ÏòàÏãú: titanic.csv ÌååÏùº Î∂àÎü¨Ïò§Í∏∞
# df = pd.read_csv('titanic.csv')
# Ïó¨Í∏∞Ïóê ÏΩîÎìúÎ•º ÏûëÏÑ±ÌïòÏÑ∏Ïöî

df.dtypes
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Age'] = df['Age'].astype(int)
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age              int64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### Î¨∏Ï†ú 5
Age Ïª¨ÎüºÏùÑ Í∏∞Ï§ÄÏúºÎ°ú Íµ¨Í∞ÑÏùÑ ÎÇòÎàÑÍ≥† Í∑∏Î£πÎ≥Ñ ÌèâÍ∑†ÏùÑ Íµ¨ÌïòÏÑ∏Ïöî.

In [71]:
import pandas as pd

# ÏòàÏãú: titanic.csv ÌååÏùº Î∂àÎü¨Ïò§Í∏∞
# df = pd.read_csv('titanic.csv')
# Ïó¨Í∏∞Ïóê ÏΩîÎìúÎ•º ÏûëÏÑ±ÌïòÏÑ∏Ïöî

# Íµ¨Í∞Ñ ÏÑ§Ï†ï: 0-18, 19-35, 36-60, 61 Ïù¥ÏÉÅ
bins = [0, 18, 35, 60, float('inf')]
labels = ['0-18', '19-35', '36-60', '61+']

# Íµ¨Í∞ÑÏùÑ Í∏∞Ï§ÄÏúºÎ°ú ÎÇòÎàÑÍ∏∞
df['Age_group'] = pd.cut(df['Age'], bins=bins, labels=labels, right=False)

# Í∞Å Í∑∏Î£πÎ≥Ñ Age ÌèâÍ∑† Íµ¨ÌïòÍ∏∞
avg_age_by_group = df.groupby('Age_group')['Age'].mean()
print(avg_age_by_group)
df

Age_group
0-18      9.958333
19-35    25.959184
36-60    44.200000
61+      68.000000
Name: Age, dtype: float64

C:\Users\user\AppData\Local\Temp\ipykernel_12384\312800752.py:15: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  avg_age_by_group = df.groupby('Age_group')['Age'].mean()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_group
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S,19-35
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C,36-60
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S,19-35
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S,36-60
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S,36-60
...,...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22,1,0,113776,66.6000,C2,S,19-35
152,153,0,3,"Meo, Mr. Alfonzo",male,55,0,0,A.5. 11206,8.0500,NaN,S,36-60
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40,0,2,A/5. 851,14.5000,NaN,S,36-60
154,155,0,3,"Olsen, Mr. Ole Martin",male,28,0,0,Fa 265302,7.3125,NaN,S,19-35
155,156,0,1,"Williams, Mr. Charles Duane",male,51,0,1,PC 17597,61.3792,NaN,C,36-60

## üîπ Í≥†Í∏â Î¨∏Ï†ú

### Î¨∏Ï†ú 1
'Pclass'ÏôÄ 'Sex'Î•º Í∏∞Ï§ÄÏúºÎ°ú Í∑∏Î£πÌôîÌïòÍ≥† 'Fare' ÌèâÍ∑†ÏùÑ Íµ¨ÌïòÏÑ∏Ïöî.

In [76]:
import pandas as pd

# ÏòàÏãú: titanic.csv ÌååÏùº Î∂àÎü¨Ïò§Í∏∞
# df = pd.read_csv('titanic.csv')
# Ïó¨Í∏∞Ïóê ÏΩîÎìúÎ•º ÏûëÏÑ±ÌïòÏÑ∏Ïöî

avg_fare_by_group = df.groupby(['Pclass', 'Sex'])['Fare'].mean()
avg_fare_by_group

Pclass  Sex
1       female    90.007400
        male      74.999600
2       female    21.325000
        male      25.216200
3       female    15.080834
        male      12.498633
Name: Fare, dtype: float64

### Î¨∏Ï†ú 2
Í≤∞Ï∏°ÏπòÍ∞Ä ÏûàÎäî ÌñâÎßå ÌïÑÌÑ∞ÎßÅÌïòÏÑ∏Ïöî.

In [85]:
import pandas as pd

# ÏòàÏãú: titanic.csv ÌååÏùº Î∂àÎü¨Ïò§Í∏∞
# df = pd.read_csv('titanic.csv')
# Ïó¨Í∏∞Ïóê ÏΩîÎìúÎ•º ÏûëÏÑ±ÌïòÏÑ∏Ïöî

df_with_missing = df[df.isnull().any(axis=1)]
df_with_missing

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_group
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S,19-35
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S,19-35
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S,36-60
5,6,0,3,"Moran, Mr. James",male,28,0,0,330877,8.4583,NaN,Q,19-35
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.0750,NaN,S,0-18
...,...,...,...,...,...,...,...,...,...,...,...,...,...
150,151,0,2,"Bateman, Rev. Robert James",male,51,0,0,S.O.P. 1166,12.5250,NaN,S,36-60
152,153,0,3,"Meo, Mr. Alfonzo",male,55,0,0,A.5. 11206,8.0500,NaN,S,36-60
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40,0,2,A/5. 851,14.5000,NaN,S,36-60
154,155,0,3,"Olsen, Mr. Ole Martin",male,28,0,0,Fa 265302,7.3125,NaN,S,19-35
155,156,0,1,"Williams, Mr. Charles Duane",male,51,0,1,PC 17597,61.3792,NaN,C,36-60

### Î¨∏Ï†ú 3
Ïù¥Î¶Ñ(Name)ÏóêÏÑú ÏÑ±(last name)Îßå Ï∂îÏ∂úÌïòÏó¨ ÏÉàÎ°úÏö¥ Ïª¨ÎüºÏùÑ ÎßåÎìúÏÑ∏Ïöî.

In [89]:
import pandas as pd

# ÏòàÏãú: titanic.csv ÌååÏùº Î∂àÎü¨Ïò§Í∏∞
# df = pd.read_csv('titanic.csv')
# Ïó¨Í∏∞Ïóê ÏΩîÎìúÎ•º ÏûëÏÑ±ÌïòÏÑ∏Ïöî

df['Last Name'] = df['Name'].str.split(",").str[0]
df[['Name', 'Last Name']].head()

                                                Name  Last Name
0                            Braund, Mr. Owen Harris     Braund
1  Cumings, Mrs. John Bradley (Florence Briggs Th...    Cumings
2                             Heikkinen, Miss. Laina  Heikkinen
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)   Futrelle
4                           Allen, Mr. William Henry      Allen

### Î¨∏Ï†ú 4
ÌÉëÏäπÌïú Ìï≠Íµ¨(Embarked)Î≥Ñ ÏÉùÏ°¥Î•†ÏùÑ Íµ¨ÌïòÏÑ∏Ïöî.

In [43]:
import pandas as pd

# ÏòàÏãú: titanic.csv ÌååÏùº Î∂àÎü¨Ïò§Í∏∞
# df = pd.read_csv('titanic.csv')
# Ïó¨Í∏∞Ïóê ÏΩîÎìúÎ•º ÏûëÏÑ±ÌïòÏÑ∏Ïöî

### Î¨∏Ï†ú 5
Í∞ÄÏû• ÎÇòÏù¥Í∞Ä ÎßéÏùÄ ÏÇ¨ÎûåÏùò Ï†ïÎ≥¥Î•º Ï∂úÎ†•ÌïòÏÑ∏Ïöî.

In [104]:
import pandas as pd

# ÏòàÏãú: titanic.csv ÌååÏùº Î∂àÎü¨Ïò§Í∏∞
# df = pd.read_csv('titanic.csv')
# Ïó¨Í∏∞Ïóê ÏΩîÎìúÎ•º ÏûëÏÑ±ÌïòÏÑ∏Ïöî

df[df['Age'] == df['Age'].max()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_group,Last Name
96,97,0,1,"Goldschmidt, Mr. George B",male,71,0,0,PC 17754,34.6542,A5,C,61+,Goldschmidt